Revit 2026 API

# IFCFileCreate Method

---

Creates an IFC file for exporting.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IFCFile Create(
	IFCFileModelOptions modelOptions
)
```
```vb
Public Shared Function Create (
	modelOptions As IFCFileModelOptions
) As IFCFile
```
```cpp
public:
static IFCFile^ Create(
	IFCFileModelOptions^ modelOptions
)
```
```fsharp
static member Create :
        modelOptions : IFCFileModelOptions -> IFCFile
```

#### Parameters

modelOptions IFCFileModelOptions
     The options.

#### Return Value

IFCFile The IFC file.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCFile Class

Autodesk.Revit.DB.IFC Namespace